org/数据库原理.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-07-22 三>
#+TITLE: 数据库原理

#+begin_quote
临近自考，本篇整理下2018年自考教材的的一些重点知识，希望自己能过吧！
#+end_quote
* 数据库系统概述
** 数据库基本概念
*** 数据是什么?
	描述事物的符号记录
*** 数据库是什么?
	简称DB,长期存储在计算机内， **有组织，可共享的大量数据集合** 。
	
	数据库的数据特点:
	- 永久存储
	- 有组织
	- 可共享
*** 数据库管理系统是什么?
	#+begin_quote
	前三点重点
	#+end_quote
	一款软件，简称DBMS，功能有:
	1. 数据定义功能
	   使用数据定义语言 **(DDL)** ，来定义数据。
	2. 数据操纵功能
	   数据操纵语言 **(DML)**，对数据进行操作，例如增删改查。
	3. 数据库的运行管理
	   用于保证数据的:
       - 安全性（数据的访问权限）
	   - 完整性（保证数据不会出错）
	   - 多用户对数据的并发处理（12306，并发访问）
	   - 系统恢复
	4. 数据的建立和维护
	   例如:
	   - 创建数据库
	   - 维护数据库
	   - 备份数据库
	   - 恢复数据库
	   - 重组数据库
	   - 性能分析、监视
	5. 数据组织、存储和管理功能
	   - 索引查找
	   - 顺序查找等
*** 数据库系统
	简称DBS，包含了上面所有，以及相关的实用工具，以及 **数据库管理员(DBA)** 。
** 数据库管理技术的发展
*** 人工管理阶段
	**记录内无结构，整体无结构**
	- 数据无法长期保存
	- 使用应用程序管理数据（关闭数据就丢失）
	- 数据面向应用
*** 文件系统阶段
	- 数据的管理者 :: 文件系统，**数据可长期保存**
	- 数据面向的对象 :: 某一应用程序
	- 数据的共享程度 :: ** 共享性差，冗余度大**
	- 数据的结构化 :: **记录内有结构，整体无结构**
	- 数据的独立性 :: **独立性差**，改变数据逻辑结构必须改变应用程序。
	- 数据控制能力 :: 由应用程序控制
*** 数据库系统阶段
	1. 数据集成（存放在一起）
	2. 数据共享性高 （不同的应用可以使用同一部分数据）
	3. 数据冗余度低 （数据可复用）
	4. 数据一致性（保证数据不会出错）
	5. 数据独立性高（数据跟应用分开）
	6. 统一管理于控制（由DBA管理）
** 数据库系统的结构
   **必考**
*** 数据库系统的三级 **模式** 结构
	1. 模式
	   描述库中数据的 **逻辑** 结构和 **特征** 。
	   1. 概念模式
		  描述数据的结构的逻辑，称为概念。
	   2. 逻辑模式
	2. 外模式
	   又叫 **子模式(SbuScheme)**
	   DBMS提供子模式描述语言。
	3. 内模式
	   又称为存储模式
	   用于描述数据库中数据 **物理** 结构和 **存储方式** 的描述。
	4. 三级模式结构的两层映像与数据独立性
	   1. 外模式/模式映像（逻辑独立性）
		  保证数据库设计变化但是处理数据的逻辑不需要变化
	   2. 模式/内模式映像（物理独立性）
		  保证数据跟应用独立
*** 数据库系统的运行于应用结构
	1. C/S
	   例如Emasc Daemon
	2. B/S
	   例如4399
** 数据模型
*** 数据特性与数据模型组成要素
	1. 数据结构
	   例如树形，队列，链式
	   用于描述系统的 **静态特征**
	2. 数据操作
	   用于描述系统的 **动态特征**
	3. 数据约束条件
	   限制数据间的语法和语义关联
	   保证数据库正确，有效，相容性
*** 数据模型的分类
	1. 概念层数据模型
	   1. 实体(Entity)
		  可以单独区分的事物，例如微信中的用户和朋友圈之间的关系。
		  客观存在并可相互区别的事物称为实体。
	   2. 属性(Attribute)
		  实体具有某一特性叫做属性，例如人这个实体有名字，身高，性别等。
	   3. 码(Key)
		  唯一标识实体的属性集，例如想在国内找到一个人，可以通过身份证号来筛选。
	   4. 域(Domain)
		  属性的取值范围，例如一个人的出生月份只能是1-12月，不能超过也不能是零或负数。
	   5. 实体型(Entity Type)
		  用实体名及其属性名集合到一起抽象刻画，同类实体就可称为实体型。
	   6. 实体集(Entity Set)
		  实体型的集合称为实体集
	   7. 联系(Relationship)
		  实体型间的联系:
		  - 1 VS 1 :: 一对一
			一人一个身份证
		  - 1 VS n :: 一对多
			一个人可以有多个子女
		  - n VS n :: 多对多
			多个人可以选多门不同的课程
	   8. 概念模型的表示方法
		  用来描述现实世界的事物，与具体计算机系统无关。
		  例如E-R图：
		  - 实体 :: 矩形
		  - 联系 :: 菱形
		  - 属性 :: 椭圆
	2. 逻辑层数据模型
	   1. 层次模型
	   2. 网状模型
	   3. **关系模型**
	   4. 面向对象模型
	3. 物理层数据模型
	   也就是硬件那些
**** 总结
	 三层模型，从上到下 概念->逻辑->物理
	 两层映像，概念->外模式 | 逻辑->模式 | 物理->内模式
* 关系数据库
** 关系数据库概述
   常用系统:
   - ORACLE :: 占有率最高
   - MYSQL :: 开源
   - IBM DB2 :: 工业行业常用
** 关系数据模型
   **关系也就是二维表格**
*** 关系数据结构
	基本术语:
	1. 表(Table)
	   由表名，以及表的列（学号，姓名），行的数据（一个学生的信息）组成。
	2. 关系(Relation)
	   一个关系在逻辑上对应一张二维表。
	3. 列(Column)
	   表中的列，称作 **字段(Filed)或属性(Attribute)** ， 每一列都有一个名称，也就是字段名或列名或属性名，每一列代表实体的一个属性。
	4. 属性(Attribute)
	   一列即一属性，表中属性个数成为关系的元或度，属性值的取值范围称为值域。
	5. 行(Row)
	   称为元组(Tuple)，也就是属性的集合，也可以称为记录(Record)
	6. 元组(Tuple)
	   例如学生表中一行的记录，也就是一个学生的所有信息。
	7. 分量(Componetn)
	   元组中的一个属性值。
	8. 码或键(Key)
	   作为标识一条元祖信息的唯一标识。
	9. 超码或超键(Super Key)
	   即基于某个码去除其中一个条件但仍然可以作为唯一标识的称为超码。
	10. 候选码或候选键(Candidate Key)
		超码的反义，基于某个码中去除其中一个就能作为唯一标识的码称为候选码。
	11. 主码或主键(Primary Key)
		从候选码中挑选一个唯一标识关系的码。
	12. 全码或全建(All-Key)
		如果把所有属性组合在一起可以组成主码，但是去掉一个就不能作为主码的叫做全码。
	13. 主属性(Primary Attribute)和非主属性(Nonprimary Attribute)
		表中存在任何一个候选码中的属性称为主属性或码属性，不包含则称为非主属性或非码属性
	14. 外码和外键(Foreign Key)
		当表中某个字段（或元组）不是当前表的主码或候选码，而是另外一个表的主码时，那么就为另外标的外码或外键。
	15. 参照关系(Referencing Relation)及被参照关系(Referenced Relation)
		例如表A的1字段是表B的外键4字段，那么表A就是表B的参照关系，而被参照关系反之。
	16. 域(Domain)
		域表示属性的取值范围
	17. 数据类型(Data Type)
		用于指定字段存放数据的类型，例如编号字段的数据类型可以是整型，而邮箱字段可以是字符串类型类型。
	18. 关系模式(Relation Schema)
		算是一种表示方式，例如可以将学生表表生成:
		学生(学号，年龄，入学时间，家庭地址，籍贯)
		#+begin_quote
		表名(字段名...)
		#+end_quote
	19. 关系数据库(relation Database)
		以关系模式作为数据的逻辑模型，并采用关系作为数据组织方式作为数据组织方式的一种数据库。
