数据库原理.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-11-10 二 15:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>数据库原理</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Evan Meek">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">数据库原理</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf1a2c9e">数据库系统概述</a>
<ul>
<li><a href="#org3d6bb71">数据库基本概念</a>
<ul>
<li><a href="#org69650ad">数据是什么?</a></li>
<li><a href="#orgda0c666">数据库是什么?</a></li>
<li><a href="#org30c988b">数据库管理系统是什么?</a></li>
<li><a href="#orgcd0078f">数据库系统</a></li>
</ul>
</li>
<li><a href="#org6e89ec5">数据库管理技术的发展</a>
<ul>
<li><a href="#org14b1c99">人工管理阶段</a></li>
<li><a href="#orged115a5">文件系统阶段</a></li>
<li><a href="#org78b2110">数据库系统阶段</a></li>
</ul>
</li>
<li><a href="#org705adaa">数据库系统的结构</a>
<ul>
<li><a href="#orgab151de">数据库系统的三级 <b><b>模式</b></b> 结构</a></li>
<li><a href="#org509b997">数据库系统的运行于应用结构</a></li>
</ul>
</li>
<li><a href="#org25efbdd">数据模型</a>
<ul>
<li><a href="#org7f685ce">数据特性与数据模型组成要素</a></li>
<li><a href="#org16199b4">数据模型的分类</a>
<ul>
<li><a href="#orgfe21790">总结</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga25a50a">关系数据库</a>
<ul>
<li><a href="#orgcfebc80">关系数据库概述</a></li>
<li><a href="#org19f0752">关系数据模型</a>
<ul>
<li><a href="#orgdc1c223">关系数据结构</a></li>
<li><a href="#orgccf05c5">关系操作集合</a></li>
</ul>
</li>
<li><a href="#org0b5c70e">关系数据库的规范理论 重点</a>
<ul>
<li><a href="#org16f99f6">关系模式中存在的冗余和异常问题</a>
<ul>
<li><a href="#orgf00f40a">数据冗余</a></li>
<li><a href="#orga75edb8">更新异常</a></li>
<li><a href="#org166c82b">插入异常</a></li>
<li><a href="#org33f1671">删除异常</a></li>
</ul>
</li>
<li><a href="#org6f43fb9">函数依赖与关键字</a></li>
<li><a href="#org826e718">范式于关系规范化过程</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org73901e5">数据库设计</a>
<ul>
<li><a href="#orgbf8fd49">数据库设计概述</a>
<ul>
<li><a href="#orga253db2">数据库的生命周期</a></li>
<li><a href="#orgaa97be9">数据库设计的目标</a></li>
<li><a href="#org941effe">数据库设计的内容</a></li>
<li><a href="#orgf161471">数据库设计的方法</a></li>
<li><a href="#org340f4d5">数据库设计的过程</a></li>
</ul>
</li>
<li><a href="#org08c6eac">数据库设计的基本步骤</a>
<ul>
<li><a href="#orge2f340d">第一步-需求分析</a></li>
<li><a href="#org2cbccd0">第二步-概念结构设计</a></li>
<li><a href="#orgb52cba6">逻辑结构设计</a></li>
</ul>
</li>
<li><a href="#org727c9eb">关系数据库设计方法</a></li>
</ul>
</li>
<li><a href="#org8b36803">SQL与关系数据库基本操作</a>
<ul>
<li><a href="#orge2341c4">SQL概述</a></li>
<li><a href="#orgd2ef341">MySQL预备知识</a></li>
<li><a href="#org1bb33a0">数据定义</a></li>
<li><a href="#org8a6d3e1">数据更新</a></li>
<li><a href="#orgb02128f">数据查询</a></li>
<li><a href="#orgcdde88d">视图</a></li>
</ul>
</li>
<li><a href="#org7d0cee4">数据库编程</a>
<ul>
<li><a href="#org0afcdfa">存储过程</a></li>
<li><a href="#orgf8ff051">存储函数</a></li>
</ul>
</li>
<li><a href="#orge077436">数据库安全与保护</a>
<ul>
<li><a href="#orgc2ee905">数据库完整性</a></li>
<li><a href="#org4e2da02">触发器</a></li>
<li><a href="#org9fc5f4c">安全性与访问控制</a></li>
<li><a href="#orge496793">事务与并发控制</a></li>
<li><a href="#org964c67f">备份与恢复</a></li>
</ul>
</li>
<li><a href="#org208bf7f">数据库应用设计与开发实例</a>
<ul>
<li><a href="#org4c94a41">需求描述与分析</a></li>
<li><a href="#org59785a5">系统设计</a></li>
</ul>
</li>
<li><a href="#org8033600">数据管理技术的发展</a>
<ul>
<li><a href="#org84d2048">数据库技术发展概述</a></li>
<li><a href="#org6ae5a73">数据仓库与数据挖掘</a></li>
<li><a href="#org6ac95ae">大数据管理技术</a></li>
</ul>
</li>
</ul>
</div>
</div>
<blockquote>
<p>
临近自考，本篇整理下2018年自考教材的的一些重点知识，希望自己能过吧！
</p>
</blockquote>
<div id="outline-container-orgf1a2c9e" class="outline-2">
<h2 id="orgf1a2c9e">数据库系统概述</h2>
<div class="outline-text-2" id="text-orgf1a2c9e">
</div>
<div id="outline-container-org3d6bb71" class="outline-3">
<h3 id="org3d6bb71">数据库基本概念</h3>
<div class="outline-text-3" id="text-org3d6bb71">
</div>
<div id="outline-container-org69650ad" class="outline-4">
<h4 id="org69650ad">数据是什么?</h4>
<div class="outline-text-4" id="text-org69650ad">
<p>
描述事物的符号记录
</p>
</div>
</div>
<div id="outline-container-orgda0c666" class="outline-4">
<h4 id="orgda0c666">数据库是什么?</h4>
<div class="outline-text-4" id="text-orgda0c666">
<p>
简称DB,长期存储在计算机内， <b><b>有组织，可共享的大量数据集合</b></b> 。
</p>

<p>
数据库的数据特点:
</p>
<ul class="org-ul">
<li>永久存储</li>
<li>有组织</li>
<li>可共享</li>
</ul>
</div>
</div>
<div id="outline-container-org30c988b" class="outline-4">
<h4 id="org30c988b">数据库管理系统是什么?</h4>
<div class="outline-text-4" id="text-org30c988b">
<blockquote>
<p>
前三点重点
</p>
</blockquote>
<p>
一款软件，简称DBMS，功能有:
</p>
<ol class="org-ol">
<li>数据定义功能
使用数据定义语言 <b><b>(DDL)</b></b> ，来定义数据。</li>
<li>数据操纵功能
数据操纵语言 **(DML)**，对数据进行操作，例如增删改查。</li>
<li>数据库的运行管理
用于保证数据的:
<ul class="org-ul">
<li>安全性（数据的访问权限）</li>
<li>完整性（保证数据不会出错）</li>
<li>多用户对数据的并发处理（12306，并发访问）</li>
<li>系统恢复</li>
</ul></li>
<li>数据的建立和维护
例如:
<ul class="org-ul">
<li>创建数据库</li>
<li>维护数据库</li>
<li>备份数据库</li>
<li>恢复数据库</li>
<li>重组数据库</li>
<li>性能分析、监视</li>
</ul></li>
<li>数据组织、存储和管理功能
<ul class="org-ul">
<li>索引查找</li>
<li>顺序查找等</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgcd0078f" class="outline-4">
<h4 id="orgcd0078f">数据库系统</h4>
<div class="outline-text-4" id="text-orgcd0078f">
<p>
简称DBS，包含了上面所有，以及相关的实用工具，以及 <b><b>数据库管理员(DBA)</b></b> 。
</p>
</div>
</div>
</div>
<div id="outline-container-org6e89ec5" class="outline-3">
<h3 id="org6e89ec5">数据库管理技术的发展</h3>
<div class="outline-text-3" id="text-org6e89ec5">
</div>
<div id="outline-container-org14b1c99" class="outline-4">
<h4 id="org14b1c99">人工管理阶段</h4>
<div class="outline-text-4" id="text-org14b1c99">
<p>
<b><b>记录内无结构，整体无结构</b></b>
</p>
<ul class="org-ul">
<li>数据无法长期保存</li>
<li>使用应用程序管理数据（关闭数据就丢失）</li>
<li>数据面向应用</li>
</ul>
</div>
</div>
<div id="outline-container-orged115a5" class="outline-4">
<h4 id="orged115a5">文件系统阶段</h4>
<div class="outline-text-4" id="text-orged115a5">
<dl class="org-dl">
<dt>数据的管理者</dt><dd>文件系统，**数据可长期保存**</dd>
<dt>数据面向的对象</dt><dd>某一应用程序</dd>
<dt>数据的共享程度</dt><dd><b>* 共享性差，冗余度大*</b></dd>
<dt>数据的结构化</dt><dd><b><b>记录内有结构，整体无结构</b></b></dd>
<dt>数据的独立性</dt><dd>**独立性差**，改变数据逻辑结构必须改变应用程序。</dd>
<dt>数据控制能力</dt><dd>由应用程序控制</dd>
</dl>
</div>
</div>
<div id="outline-container-org78b2110" class="outline-4">
<h4 id="org78b2110">数据库系统阶段</h4>
<div class="outline-text-4" id="text-org78b2110">
<ol class="org-ol">
<li>数据集成（存放在一起）</li>
<li>数据共享性高 （不同的应用可以使用同一部分数据）</li>
<li>数据冗余度低 （数据可复用）</li>
<li>数据一致性（保证数据不会出错）</li>
<li>数据独立性高（数据跟应用分开）</li>
<li>统一管理于控制（由DBA管理）</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org705adaa" class="outline-3">
<h3 id="org705adaa">数据库系统的结构</h3>
<div class="outline-text-3" id="text-org705adaa">
<p>
<b><b>必考</b></b>
</p>
</div>
<div id="outline-container-orgab151de" class="outline-4">
<h4 id="orgab151de">数据库系统的三级 <b><b>模式</b></b> 结构</h4>
<div class="outline-text-4" id="text-orgab151de">
<ol class="org-ol">
<li>模式
描述库中数据的 <b><b>逻辑</b></b> 结构和 <b><b>特征</b></b> 。
<ol class="org-ol">
<li>概念模式
描述数据的结构的逻辑，称为概念。</li>
<li>逻辑模式</li>
</ol></li>
<li>外模式
又叫 <b><b>子模式(SbuScheme)</b></b>
DBMS提供子模式描述语言。</li>
<li>内模式
又称为存储模式
用于描述数据库中数据 <b><b>物理</b></b> 结构和 <b><b>存储方式</b></b> 的描述。</li>
<li>三级模式结构的两层映像与数据独立性
<ol class="org-ol">
<li>外模式/模式映像（逻辑独立性）
保证数据库设计变化但是处理数据的逻辑不需要变化</li>
<li>模式/内模式映像（物理独立性）
保证数据跟应用独立</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org509b997" class="outline-4">
<h4 id="org509b997">数据库系统的运行于应用结构</h4>
<div class="outline-text-4" id="text-org509b997">
<ol class="org-ol">
<li>C/S
例如Emasc Daemon</li>
<li>B/S
例如4399</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org25efbdd" class="outline-3">
<h3 id="org25efbdd">数据模型</h3>
<div class="outline-text-3" id="text-org25efbdd">
</div>
<div id="outline-container-org7f685ce" class="outline-4">
<h4 id="org7f685ce">数据特性与数据模型组成要素</h4>
<div class="outline-text-4" id="text-org7f685ce">
<ol class="org-ol">
<li>数据结构
例如树形，队列，链式
用于描述系统的 <b><b>静态特征</b></b></li>
<li>数据操作
用于描述系统的 <b><b>动态特征</b></b></li>
<li>数据约束条件
限制数据间的语法和语义关联
保证数据库正确，有效，相容性</li>
</ol>
</div>
</div>
<div id="outline-container-org16199b4" class="outline-4">
<h4 id="org16199b4">数据模型的分类</h4>
<div class="outline-text-4" id="text-org16199b4">
<ol class="org-ol">
<li>概念层数据模型
<ol class="org-ol">
<li>实体(Entity)
可以单独区分的事物，例如微信中的用户和朋友圈之间的关系。
客观存在并可相互区别的事物称为实体。</li>
<li>属性(Attribute)
实体具有某一特性叫做属性，例如人这个实体有名字，身高，性别等。</li>
<li>码(Key)
唯一标识实体的属性集，例如想在国内找到一个人，可以通过身份证号来筛选。</li>
<li>域(Domain)
属性的取值范围，例如一个人的出生月份只能是1-12月，不能超过也不能是零或负数。</li>
<li>实体型(Entity Type)
用实体名及其属性名集合到一起抽象刻画，同类实体就可称为实体型。</li>
<li>实体集(Entity Set)
实体型的集合称为实体集</li>
<li>联系(Relationship)
实体型间的联系:
<dl class="org-dl">
<dt>1 VS 1</dt><dd>一对一
一人一个身份证</dd>
<dt>1 VS n</dt><dd>一对多
一个人可以有多个子女</dd>
<dt>n VS n</dt><dd>多对多
多个人可以选多门不同的课程</dd>
</dl></li>
<li>概念模型的表示方法
用来描述现实世界的事物，与具体计算机系统无关。
例如E-R图：
<dl class="org-dl">
<dt>实体</dt><dd>矩形</dd>
<dt>联系</dt><dd>菱形</dd>
<dt>属性</dt><dd>椭圆</dd>
</dl></li>
</ol></li>
<li>逻辑层数据模型
<ol class="org-ol">
<li>层次模型</li>
<li>网状模型</li>
<li><b><b>关系模型</b></b></li>
<li>面向对象模型</li>
</ol></li>
<li>物理层数据模型
也就是硬件那些</li>
</ol>
</div>
<div id="outline-container-orgfe21790" class="outline-5">
<h5 id="orgfe21790">总结</h5>
<div class="outline-text-5" id="text-orgfe21790">
<p>
三层模型，从上到下 概念-&gt;逻辑-&gt;物理
两层映像，概念-&gt;外模式 | 逻辑-&gt;模式 | 物理-&gt;内模式
</p>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orga25a50a" class="outline-2">
<h2 id="orga25a50a">关系数据库</h2>
<div class="outline-text-2" id="text-orga25a50a">
</div>
<div id="outline-container-orgcfebc80" class="outline-3">
<h3 id="orgcfebc80">关系数据库概述</h3>
<div class="outline-text-3" id="text-orgcfebc80">
<p>
常用系统:
</p>
<dl class="org-dl">
<dt>ORACLE</dt><dd>占有率最高</dd>
<dt>MYSQL</dt><dd>开源</dd>
<dt>IBM DB2</dt><dd>工业行业常用</dd>
</dl>
</div>
</div>
<div id="outline-container-org19f0752" class="outline-3">
<h3 id="org19f0752">关系数据模型</h3>
<div class="outline-text-3" id="text-org19f0752">
<p>
<b><b>关系也就是二维表格</b></b>
</p>
</div>
<div id="outline-container-orgdc1c223" class="outline-4">
<h4 id="orgdc1c223">关系数据结构</h4>
<div class="outline-text-4" id="text-orgdc1c223">
<p>
基本术语:
</p>
<ol class="org-ol">
<li>表(Table)
由表名，以及表的列（学号，姓名），行的数据（一个学生的信息）组成。</li>
<li>关系(Relation)
一个关系在逻辑上对应一张二维表。</li>
<li>列(Column)
表中的列，称作 <b><b>字段(Filed)或属性(Attribute)</b></b> ， 每一列都有一个名称，也就是字段名或列名或属性名，每一列代表实体的一个属性。</li>
<li>属性(Attribute)
一列即一属性，表中属性个数成为关系的元或度，属性值的取值范围称为值域。</li>
<li>行(Row)
称为元组(Tuple)，也就是属性的集合，也可以称为记录(Record)</li>
<li>元组(Tuple)
例如学生表中一行的记录，也就是一个学生的所有信息。</li>
<li>分量(Componetn)
元组中的一个属性值。</li>
<li>码或键(Key)
作为标识一条元祖信息的唯一标识。</li>
<li>超码或超键(Super Key)
即基于某个码去除其中一个条件但仍然可以作为唯一标识的称为超码。</li>
<li>候选码或候选键(Candidate Key)
超码的反义，基于某个码中去除其中一个就能作为唯一标识的码称为候选码。</li>
<li>主码或主键(Primary Key)
从候选码中挑选一个唯一标识关系的码。</li>
<li>全码或全建(All-Key)
如果把所有属性组合在一起可以组成主码，但是去掉一个就不能作为主码的叫做全码。</li>
<li>主属性(Primary Attribute)和非主属性(Nonprimary Attribute)
表中存在任何一个候选码中的属性称为主属性或码属性，不包含则称为非主属性或非码属性</li>
<li>外码和外键(Foreign Key)
当表中某个字段（或元组）不是当前表的主码或候选码，而是另外一个表的主码时，那么就为另外标的外码或外键。</li>
<li>参照关系(Referencing Relation)及被参照关系(Referenced Relation)
例如表A的1字段是表B的外键4字段，那么表A就是表B的参照关系，而被参照关系反之。</li>
<li>域(Domain)
域表示属性的取值范围</li>
<li>数据类型(Data Type)
用于指定字段存放数据的类型，例如编号字段的数据类型可以是整型，而邮箱字段可以是字符串类型类型。</li>
<li><p>
关系模式(Relation Schema)
算是一种表示方式，例如可以将学生表表生成:
学生(学号，年龄，入学时间，家庭地址，籍贯)
</p>
<blockquote>
<p>
表名(字段名&#x2026;)
</p>
</blockquote></li>
<li>关系数据库(relation Database)
以关系模式作为数据的逻辑模型，并采用关系作为数据组织方式作为数据组织方式的一种数据库。</li>
</ol>
</div>
</div>
