org/数据库原理.org
*** 关系操作集合
	1. 基本的关系操作
	   1. 查询
		  选择、投影、连接、除、并、交、差、笛卡尔积
	   2. 数据更新
		  插入、删除、修改
	   3. 关系操作的特点
		  集合操作方法，即操作的对象和结果都是集合。
	2. 关系数据语言的分类
	   分为两类，分别是:
	   1. 代数方式
		  代数方式主要为 **关系代数**，通过对关系的操作来查询要求方式。
		  1. 关系代数
			 1. 集合运算符
				数据:
				#+begin_center
				A={1,2,3,4}
				B={3,4,5,6}
				#+end_center
				1. 并集 
				   #+begin_center
				   A 并 B
				   并 = {1,2,3,4,5,6}
				   #+end_center
				2. 差
				   #+begin_center
				   A 差 B
				   差 = {1,2}
				   #+end_center
				3. 交
				   #+begin_center
				   A 交 B
				   交 = {3,4}
				   #+end_center
				4. 笛卡尔积
				   #+begin_center
				   A 笛卡尔积 B
				   笛卡尔积 = {[1,3],[1,4],[1,5],[1,6],[2,3],[2,4],[2,5],[2,6],...[4,3],[4,4]}
				   #+end_center
			 2. 专有的关系运算符
				1. 选择(SELECT)
				   行变，列不变
				   ~SELECT 表名 WHERE 条件~
				2. 投影(PROJECTION)
				   行不变，列变
				   ~PROJECTION 表名(字段名)~
				3. 连接(JOIN)
				   像笛卡尔积加条件
				   ~JOIN 表1 AND 表2 WHERE 条件~
				4. 除(DIVISION)
				   笛卡尔积的逆运算
			 3. 比较操作
				
			 4. 逻辑操作
	   2. 逻辑方式
	3. 关系的完整性约束
	   1. 实体完整性约束
		  关系必须有一个主属性
	   2. 参照完整性约束
		  保证多个实体之间必须存在某种联系
		  用来保证多个关系之间属性的完整性
	   3. 用户定义完整性约束
		  针对某场景的完整性约束条件
	   4. 关系模型完整性约束的检验
		  1. 执行插入
		  2. 执行查询
		  3. 执行删除
** 关系数据库的规范理论 重点
*** 关系模式中存在的冗余和异常问题
**** 数据冗余
**** 更新异常
**** 插入异常
**** 删除异常
*** 函数依赖与关键字
	函数依赖是指 **关系中属性间的对应关系**
	 下面有几种依赖的定义，每个依赖都不同，将会一一说明=。
	 1. 完全函数依赖
	   举例说明：
	   #+begin_center
	   现有学生选课关系SC(SNO,CNO,CTITLE,INAME,IPLACE,GRADE)，其中有(SNO,CNO)->GRADE完全依赖关系，因为学生成绩必须由学号和课程号同时满足此依赖，也就是说少了学号就无法判断此课程的成绩算
	   谁的，反之亦然。
	   #+end_center
	 2. 部分函数依赖
		此种依赖关系跟完全函数依赖很像，以上面的举例假设说明，(SNO,CNO)->GRADE关系，上面的完全函数依赖是指SNO,CNO缺一不可，而部分函数依赖则是只需要其中一个就可以满足->GRADE的依赖关系。
	 3. 传递函数依赖
		数学表示: 设R为任一给定关系，X,Y,Z为其不同属性子集，若X->Y,Y-x>X(-x>代表不满足依赖定义),Y->Z，那么X->Z，称为Z传递函数依赖于X。
		例子: 书本管理表BOOKS(BNO,PNAME,PADDRESS)，属性含义分别是，书号，出版社名，出版社地址，其中书号可以决定出版社名，出版社名可以决定出版社地址，正好满足传递函数依赖，
		BNO->PNAME PNAME-x>BNO PNAME->PADDRESS		
*** 范式于关系规范化过程
	
* 数据库设计
** 数据库设计概述
   本章介绍数据库设计的特点、方法于过程，其中关系数据库的结构设计是本章的学习重点。
*** 数据库的生命周期
	从数据库演变过程看，分为两个阶段:
 	1. 数据库分析与设计
	   1. 需求分析
	   2. 概念设计
	   3. 逻辑设计
	   4. 物理设计
	2. 数据库实现与操作
	   1. 实现
	   2. 操作
	   3. 监督
	   4. 修改
	   5. 调整
*** 数据库设计的目标
	1. 满足功能需求
	   增删改查
	2. 数据库性能
	   保证数据完整性，共享性，一致性，安全保密性。
*** 数据库设计的内容
	1. 数据库结构设计
	   静态的，用来定义数据库的组成方式，一般定义好后不会随意更改。
	   - 概念结构
	   - 逻辑结构
	   - 物理结构
	2. 数据库行为设计
	   由应用程序实现，动态的，用来操作数据库中的数据。
*** 数据库设计的方法
	1. 直观设计法
	   特点：根据经验设计数据库模式
	   缺点：缺乏科学理论的指导，设计的质量无法保证。
	2. 规范设计法
	   常用，普遍，有三种
	   1. 新奥尔良(New Orleans)设计方法
		  优点：规范，权威，公认的好设计方法
		  特点：注重数据库结构设计，行为设计不太在意。
		  设计阶段：
		  1. 需求分析
		  2. 概念结构设计
		  3. 逻辑结构设计
		  4. 物理结构设计
	   2. 基于E-R模型的数据库设计方法
		  优点：有模型图可看
	   3. 基于第三范式的设计方法
		  是一种结构化设计方法，思想为：在需求分析基础上提前确定数据库的模式，属性，及属性间的依赖关系，随后将其组织在一个单一的关系模式中，如果模式中存在
		  不符合第三范式的约束条件，则进行分解。
	3. 计算机辅助设计方法
	   以数据库领域专家的知识或经验为主导，然后通过一些应用程序辅助设计，例如CASE，以及Rotaional的Rose。
*** 数据库设计的过程
	分为以下几个阶段:
	1. 需求分析阶段
	2. 结构设计阶段
	   - 概念结构设计
	   - 逻辑结构设计
	   - 物理结构设计
	3. 行为设计阶段
	   1. 功能设计
	   2. 事务设计
	   3. 程序设计
	4. 实施阶段
	   1. 加载数据
	   2. 调试运行
	5. 运行维护阶段
** 数据库设计的基本步骤
   目前分阶段规范设计方法已在数据库设计中得到广泛应用，通过自顶向下，逐步求精的原则，将数据库设计分为以下几个步骤，下面将会详细盘点。
   #+begin_quote
   由于数据库设计将结构设计阶段跟行为设计阶段划分的很开，所以本章侧重于结构设计阶段。
   #+end_quote
*** 第一步-需求分析
	目标: 了解、分析客户要求，并且按照一定格式整理为一个需求分析报告，这个报告在后面的结构设计阶段有大大滴用处。
	主要分为四个步骤:
	1. 确定数据库范围
	   大白话解释: 确定数据库是拿来干嘛的，用处是啥。
	   注意事项: 数据库设计应该尽可能的让其有更广泛的应用领域，但是越广泛意味着更复杂，更复杂意味着成本的提高，所以我们必须在实现客户的基本需求之上再提升数据库的应用场景。
	2. 应用过程分析
	   大白话解释: 对应着行为设计那部分的，主要是提前了解分析到时候数据要如何处理。
	   其他: 应用过程分析可以借助流程图等软件来进行设计。
	3. 收集与分析数据
	   定义: 作用是了解并分析数据的组成格式及操作特性，确定每个数据元素的语义及关系，并将其收集起来归档。
	   数据有两种结构，分为静态和动态，并且我们还需要有其他的特殊要求：
	   1. 静态结构
		  静态结构是指不施加应用操作于数据上时，数据的原始状况。这些静态信息可以由数据分类表和数据元素表进行说明。
		  - 数据分类表
			对数据的总体描述，例如学生数据表可以有以下说明:
			| 数据ID | 数据名 | 用途 | 主人 | 用户 | 来源 | 去向 | 存档时间 | 数据量 |
			这些静态信息足以提供数据的相关信息。
		  - 数据元素表
			元素表用以记录每个数据列的说明，例如下表:
			| 数据ID | 数据元素ID | 元素名 | 意义 | 类型 | 长度 | 算法 | 备注 |
	   2. 动态结构
		  动态结构是指将应用操作施加于数据之上后数据的情况，可通过任务分类表和数据操作特征表进行描述。
		  - 任务分类表
			如果根据数据流程图的分析，可将业务处理过程划分为不同任务。
			| 任务ID | 名称 | 功能 | 类型 | 主人 | 用户 | 执行日期 | 频率 | 操作过程 | 备注 |
			类型属性可分为输入、查询、制表、统计、修改、删除等;频率为此项任务执行次数。
		  - 数据操作特征表
			数据操作特征表用以描述任务和数据之间的关系。
	   3. 数据约束 
		  数据约束用于指定使用数据时的特殊要求，有以下几个点:
		  - 安全保密性
			针对各种不同类型数据，谁拥有什么操作（增删改查）的权限。
		  - 数据的完整性
			保证数据的正确性，通过取值范围和验证准则进行保护。
		  - 响应时间
			某些特定应用要求数据存取时间限制。
		  - 数据恢复
			当数据需要转储及恢复的时机与范围要求。
	4. 编写需求分析报告
	   需求分析报告通常由以下内容组成:
	   - 数据库的应用功能目标
	   - 标明不同用户视图的范围
	   - 应用处理过程需求说明
		 - 数据流程图
		 - 任务分类表
		 - 数据操作特性表
		 - 操作过程说明书
	   - 数据字典
		 (DAta Dictionary,DD)，是数据库系统中存储三级结构定义的数据库，通常指的是数据库系统中各类数据详细描述的集合。
	   - 数据量
	   - 数据约束
*** 第二步-概念结构设计
	特点: 不受DBMS限制，纯概念。
	目标: 基于需求分析作最大限度满足应用需求
