数据库原理.html
<div id="outline-container-orgccf05c5" class="outline-4">
<h4 id="orgccf05c5">关系操作集合</h4>
<div class="outline-text-4" id="text-orgccf05c5">
<ol class="org-ol">
<li>基本的关系操作
<ol class="org-ol">
<li>查询
选择、投影、连接、除、并、交、差、笛卡尔积</li>
<li>数据更新
插入、删除、修改</li>
<li>关系操作的特点
集合操作方法，即操作的对象和结果都是集合。</li>
</ol></li>
<li>关系数据语言的分类
分为两类，分别是:
<ol class="org-ol">
<li>代数方式
代数方式主要为 **关系代数**，通过对关系的操作来查询要求方式。
<ol class="org-ol">
<li>关系代数
<ol class="org-ol">
<li><p>
集合运算符
数据:
</p>
<div class="org-center">
<p>
A={1,2,3,4}
B={3,4,5,6}
</p>
</div>
<ol class="org-ol">
<li><p>
并集 
</p>
<div class="org-center">
<p>
A 并 B
并 = {1,2,3,4,5,6}
</p>
</div></li>
<li><p>
差
</p>
<div class="org-center">
<p>
A 差 B
差 = {1,2}
</p>
</div></li>
<li><p>
交
</p>
<div class="org-center">
<p>
A 交 B
交 = {3,4}
</p>
</div></li>
<li><p>
笛卡尔积
</p>
<div class="org-center">
<p>
A 笛卡尔积 B
笛卡尔积 = {[1,3],[1,4],[1,5],[1,6],[2,3],[2,4],[2,5],[2,6],&#x2026;[4,3],[4,4]}
</p>
</div></li>
</ol></li>
<li>专有的关系运算符
<ol class="org-ol">
<li>选择(SELECT)
行变，列不变
<code>SELECT 表名 WHERE 条件</code></li>
<li>投影(PROJECTION)
行不变，列变
<code>PROJECTION 表名(字段名)</code></li>
<li>连接(JOIN)
像笛卡尔积加条件
<code>JOIN 表1 AND 表2 WHERE 条件</code></li>
<li>除(DIVISION)
笛卡尔积的逆运算</li>
</ol></li>
<li>比较操作</li>

<li>逻辑操作</li>
</ol></li>
</ol></li>
<li>逻辑方式</li>
</ol></li>
<li>关系的完整性约束
<ol class="org-ol">
<li>实体完整性约束
关系必须有一个主属性</li>
<li>参照完整性约束
保证多个实体之间必须存在某种联系
用来保证多个关系之间属性的完整性</li>
<li>用户定义完整性约束
针对某场景的完整性约束条件</li>
<li>关系模型完整性约束的检验
<ol class="org-ol">
<li>执行插入</li>
<li>执行查询</li>
<li>执行删除</li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org0b5c70e" class="outline-3">
<h3 id="org0b5c70e">关系数据库的规范理论 重点</h3>
<div class="outline-text-3" id="text-org0b5c70e">
</div>
<div id="outline-container-org16f99f6" class="outline-4">
<h4 id="org16f99f6">关系模式中存在的冗余和异常问题</h4>
<div class="outline-text-4" id="text-org16f99f6">
</div>
<div id="outline-container-orgf00f40a" class="outline-5">
<h5 id="orgf00f40a">数据冗余</h5>
</div>
<div id="outline-container-orga75edb8" class="outline-5">
<h5 id="orga75edb8">更新异常</h5>
</div>
<div id="outline-container-org166c82b" class="outline-5">
<h5 id="org166c82b">插入异常</h5>
</div>
<div id="outline-container-org33f1671" class="outline-5">
<h5 id="org33f1671">删除异常</h5>
</div>
</div>
<div id="outline-container-org6f43fb9" class="outline-4">
<h4 id="org6f43fb9">函数依赖与关键字</h4>
<div class="outline-text-4" id="text-org6f43fb9">
<p>
函数依赖是指 <b><b>关系中属性间的对应关系</b></b>
 下面有几种依赖的定义，每个依赖都不同，将会一一说明=。
</p>
<ol class="org-ol">
<li><p>
完全函数依赖
举例说明：
</p>
<div class="org-center">
<p>
现有学生选课关系SC(SNO,CNO,CTITLE,INAME,IPLACE,GRADE)，其中有(SNO,CNO)-&gt;GRADE完全依赖关系，因为学生成绩必须由学号和课程号同时满足此依赖，也就是说少了学号就无法判断此课程的成绩算
谁的，反之亦然。
</p>
</div></li>
<li>部分函数依赖
此种依赖关系跟完全函数依赖很像，以上面的举例假设说明，(SNO,CNO)-&gt;GRADE关系，上面的完全函数依赖是指SNO,CNO缺一不可，而部分函数依赖则是只需要其中一个就可以满足-&gt;GRADE的依赖关系。</li>
<li>传递函数依赖
数学表示: 设R为任一给定关系，X,Y,Z为其不同属性子集，若X-&gt;Y,Y-x&gt;X(-x&gt;代表不满足依赖定义),Y-&gt;Z，那么X-&gt;Z，称为Z传递函数依赖于X。
例子: 书本管理表BOOKS(BNO,PNAME,PADDRESS)，属性含义分别是，书号，出版社名，出版社地址，其中书号可以决定出版社名，出版社名可以决定出版社地址，正好满足传递函数依赖，
BNO-&gt;PNAME PNAME-x&gt;BNO PNAME-&gt;PADDRESS</li>
</ol>
</div>
</div>
<div id="outline-container-org826e718" class="outline-4">
<h4 id="org826e718">范式于关系规范化过程</h4>
</div>
</div>
</div>

<div id="outline-container-org73901e5" class="outline-2">
<h2 id="org73901e5">数据库设计</h2>
<div class="outline-text-2" id="text-org73901e5">
</div>
<div id="outline-container-orgbf8fd49" class="outline-3">
<h3 id="orgbf8fd49">数据库设计概述</h3>
<div class="outline-text-3" id="text-orgbf8fd49">
<p>
本章介绍数据库设计的特点、方法于过程，其中关系数据库的结构设计是本章的学习重点。
</p>
</div>
<div id="outline-container-orga253db2" class="outline-4">
<h4 id="orga253db2">数据库的生命周期</h4>
<div class="outline-text-4" id="text-orga253db2">
<p>
从数据库演变过程看，分为两个阶段:
</p>
<ol class="org-ol">
<li>数据库分析与设计
<ol class="org-ol">
<li>需求分析</li>
<li>概念设计</li>
<li>逻辑设计</li>
<li>物理设计</li>
</ol></li>
<li>数据库实现与操作
<ol class="org-ol">
<li>实现</li>
<li>操作</li>
<li>监督</li>
<li>修改</li>
<li>调整</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-orgaa97be9" class="outline-4">
<h4 id="orgaa97be9">数据库设计的目标</h4>
<div class="outline-text-4" id="text-orgaa97be9">
<ol class="org-ol">
<li>满足功能需求
增删改查</li>
<li>数据库性能
保证数据完整性，共享性，一致性，安全保密性。</li>
</ol>
</div>
</div>
<div id="outline-container-org941effe" class="outline-4">
<h4 id="org941effe">数据库设计的内容</h4>
<div class="outline-text-4" id="text-org941effe">
<ol class="org-ol">
<li>数据库结构设计
静态的，用来定义数据库的组成方式，一般定义好后不会随意更改。
<ul class="org-ul">
<li>概念结构</li>
<li>逻辑结构</li>
<li>物理结构</li>
</ul></li>
<li>数据库行为设计
由应用程序实现，动态的，用来操作数据库中的数据。</li>
</ol>
</div>
</div>
<div id="outline-container-orgf161471" class="outline-4">
<h4 id="orgf161471">数据库设计的方法</h4>
<div class="outline-text-4" id="text-orgf161471">
<ol class="org-ol">
<li>直观设计法
特点：根据经验设计数据库模式
缺点：缺乏科学理论的指导，设计的质量无法保证。</li>
<li>规范设计法
常用，普遍，有三种
<ol class="org-ol">
<li>新奥尔良(New Orleans)设计方法
优点：规范，权威，公认的好设计方法
特点：注重数据库结构设计，行为设计不太在意。
设计阶段：
<ol class="org-ol">
<li>需求分析</li>
<li>概念结构设计</li>
<li>逻辑结构设计</li>
<li>物理结构设计</li>
</ol></li>
<li>基于E-R模型的数据库设计方法
优点：有模型图可看</li>
<li>基于第三范式的设计方法
是一种结构化设计方法，思想为：在需求分析基础上提前确定数据库的模式，属性，及属性间的依赖关系，随后将其组织在一个单一的关系模式中，如果模式中存在
不符合第三范式的约束条件，则进行分解。</li>
</ol></li>
<li>计算机辅助设计方法
以数据库领域专家的知识或经验为主导，然后通过一些应用程序辅助设计，例如CASE，以及Rotaional的Rose。</li>
</ol>
</div>
</div>
<div id="outline-container-org340f4d5" class="outline-4">
<h4 id="org340f4d5">数据库设计的过程</h4>
<div class="outline-text-4" id="text-org340f4d5">
<p>
分为以下几个阶段:
</p>
<ol class="org-ol">
<li>需求分析阶段</li>
<li>结构设计阶段
<ul class="org-ul">
<li>概念结构设计</li>
<li>逻辑结构设计</li>
<li>物理结构设计</li>
</ul></li>
<li>行为设计阶段
<ol class="org-ol">
<li>功能设计</li>
<li>事务设计</li>
<li>程序设计</li>
</ol></li>
<li>实施阶段
<ol class="org-ol">
<li>加载数据</li>
<li>调试运行</li>
</ol></li>
<li>运行维护阶段</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org08c6eac" class="outline-3">
<h3 id="org08c6eac">数据库设计的基本步骤</h3>
<div class="outline-text-3" id="text-org08c6eac">
<p>
目前分阶段规范设计方法已在数据库设计中得到广泛应用，通过自顶向下，逐步求精的原则，将数据库设计分为以下几个步骤，下面将会详细盘点。
</p>
<blockquote>
<p>
由于数据库设计将结构设计阶段跟行为设计阶段划分的很开，所以本章侧重于结构设计阶段。
</p>
</blockquote>
</div>
<div id="outline-container-orge2f340d" class="outline-4">
<h4 id="orge2f340d">第一步-需求分析</h4>
<div class="outline-text-4" id="text-orge2f340d">
<p>
目标: 了解、分析客户要求，并且按照一定格式整理为一个需求分析报告，这个报告在后面的结构设计阶段有大大滴用处。
主要分为四个步骤:
</p>
<ol class="org-ol">
<li>确定数据库范围
大白话解释: 确定数据库是拿来干嘛的，用处是啥。
注意事项: 数据库设计应该尽可能的让其有更广泛的应用领域，但是越广泛意味着更复杂，更复杂意味着成本的提高，所以我们必须在实现客户的基本需求之上再提升数据库的应用场景。</li>
<li>应用过程分析
大白话解释: 对应着行为设计那部分的，主要是提前了解分析到时候数据要如何处理。
其他: 应用过程分析可以借助流程图等软件来进行设计。</li>
<li>收集与分析数据
定义: 作用是了解并分析数据的组成格式及操作特性，确定每个数据元素的语义及关系，并将其收集起来归档。
数据有两种结构，分为静态和动态，并且我们还需要有其他的特殊要求：
<ol class="org-ol">
<li>静态结构
静态结构是指不施加应用操作于数据上时，数据的原始状况。这些静态信息可以由数据分类表和数据元素表进行说明。
<ul class="org-ul">
<li><p>
数据分类表
对数据的总体描述，例如学生数据表可以有以下说明:
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">数据ID</td>
<td class="org-left">数据名</td>
<td class="org-left">用途</td>
<td class="org-left">主人</td>
<td class="org-left">用户</td>
<td class="org-left">来源</td>
<td class="org-left">去向</td>
<td class="org-left">存档时间</td>
<td class="org-left">数据量</td>
</tr>
</tbody>
</table>
<p>
这些静态信息足以提供数据的相关信息。
</p></li>
<li><p>
数据元素表
元素表用以记录每个数据列的说明，例如下表:
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">数据ID</td>
<td class="org-left">数据元素ID</td>
<td class="org-left">元素名</td>
<td class="org-left">意义</td>
<td class="org-left">类型</td>
<td class="org-left">长度</td>
<td class="org-left">算法</td>
<td class="org-left">备注</td>
</tr>
</tbody>
</table></li>
</ul></li>
<li>动态结构
动态结构是指将应用操作施加于数据之上后数据的情况，可通过任务分类表和数据操作特征表进行描述。
<ul class="org-ul">
<li><p>
任务分类表
如果根据数据流程图的分析，可将业务处理过程划分为不同任务。
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">任务ID</td>
<td class="org-left">名称</td>
<td class="org-left">功能</td>
<td class="org-left">类型</td>
<td class="org-left">主人</td>
<td class="org-left">用户</td>
<td class="org-left">执行日期</td>
<td class="org-left">频率</td>
<td class="org-left">操作过程</td>
<td class="org-left">备注</td>
</tr>
</tbody>
</table>
<p>
类型属性可分为输入、查询、制表、统计、修改、删除等;频率为此项任务执行次数。
</p></li>
<li>数据操作特征表
数据操作特征表用以描述任务和数据之间的关系。</li>
</ul></li>
<li>数据约束 
数据约束用于指定使用数据时的特殊要求，有以下几个点:
<ul class="org-ul">
<li>安全保密性
针对各种不同类型数据，谁拥有什么操作（增删改查）的权限。</li>
<li>数据的完整性
保证数据的正确性，通过取值范围和验证准则进行保护。</li>
<li>响应时间
某些特定应用要求数据存取时间限制。</li>
<li>数据恢复
当数据需要转储及恢复的时机与范围要求。</li>
</ul></li>
</ol></li>
<li>编写需求分析报告
需求分析报告通常由以下内容组成:
<ul class="org-ul">
<li>数据库的应用功能目标</li>
<li>标明不同用户视图的范围</li>
<li>应用处理过程需求说明
<ul class="org-ul">
<li>数据流程图</li>
<li>任务分类表</li>
<li>数据操作特性表</li>
<li>操作过程说明书</li>
</ul></li>
<li>数据字典
(DAta Dictionary,DD)，是数据库系统中存储三级结构定义的数据库，通常指的是数据库系统中各类数据详细描述的集合。</li>
<li>数据量</li>
<li>数据约束</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org2cbccd0" class="outline-4">
<h4 id="org2cbccd0">第二步-概念结构设计</h4>
<div class="outline-text-4" id="text-org2cbccd0">
<p>
特点: 不受DBMS限制，纯概念。
目标: 基于需求分析作最大限度满足应用需求
</p>
</div>
</div>
